app/controllers/donations_controller.rb

  def create
    @donation = Donation.new(donation_params)

    respond_to do |format|
      if @donation.save
---
INSERT INTO "donations" ("name", "description", "category", "city", "expiry", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_donation
      @donation = Donation.find(params[:id])
---
SELECT  "donations".* FROM "donations" WHERE "donations"."id" = ? LIMIT 1  [["id", 1]]